#Задача 4

cranes = int(input("Введите кол-во журавликов "))

print(f"\nПетя сделал: {cranes // 6}\nКатя сделала: {cranes // 2} \nСережа сделал: {cranes // 6}")
# x 4x x